src_test/extensions-testbed/results/1.3.1/return-false-cin/soap-trace-server.log

Tracing Web Service: {urn:hello:wsdl}HelloService
Inbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header/>
  <S:Body>
    <sayHello xmlns="urn:hello:wsdl">
      <name>friend</name>
    </sayHello>
  </S:Body>
</S:Envelope>
Tracing Web Service: {urn:hello:wsdl}HelloService
Inbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header/>
  <S:Body>
    <sayHello xmlns="urn:hello:wsdl">
      <name>friend</name>
    </sayHello>
  </S:Body>
</S:Envelope>
Tracing Web Service: {urn:hello:wsdl}HelloService
Outbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <sayHelloResponse xmlns="urn:hello:wsdl">
      <return>Hello friend</return>
    </sayHelloResponse>
  </S:Body>
</S:Envelope>
Tracing Web Service: {urn:hello:wsdl}HelloService
Outbound SOAP message:
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <sayHelloResponse xmlns="urn:hello:wsdl">
      <return>Hello friend</return>
    </sayHelloResponse>
  </S:Body>
</S:Envelope>
